Revit 2027 API
BuiltInFailures.AutoRouteFailures.SolutionIsOppositeToConnectionError Property
 The solution is in the opposite direction of the connection direction.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId SolutionIsOppositeToConnectionError { get; }
Public Shared ReadOnly Property SolutionIsOppositeToConnectionError As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ SolutionIsOppositeToConnectionError {
	FailureDefinitionId^ get ();
}
static member SolutionIsOppositeToConnectionError : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.AutoRouteFailures Class
Autodesk.Revit.DB Namespace